In [1]:
import pandas as pd
import numpy as np

creation d'un dataframe

In [2]:
data = {"Nom":["Alice","Bob","Charlie"],
       "Age":[25,30,50],
        "Ville":["Paris","New York","Londres"]}

In [3]:
df = pd.DataFrame(data)

In [5]:
df

       Nom  Age     Ville
0    Alice   25     Paris
1      Bob   30  New York
2  Charlie   50   Londres

In [6]:
df["Salaire"]=[50000,60000,42000] #ajout d'une nouvelle colonne

In [ ]:
print(type(df))

In [ ]:
df.shape # permet de connaitre le nombre de lignes et de colonnes

In [ ]:
df.info() # peut nous faire savoir si on a des valeurs manquante 'Non-Null Count'

In [ ]:
df.isna() # retourne dataframe uniquement ou il y a un none

In [ ]:
df.isna().sum() #Pour donner tous les none et la somme des nones

In [ ]:
df.head(1) # pour les x premiere valeurs

In [ ]:
df.tail(1) # pour les x derniere valeurs